//====================================================//
// ファイル名   : BaseComponent.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/02
//
// 概要 : 全てのコンポーネントの基底となるクラスです
//
// 更新履歴 :
// 2026/04/02 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

//====================================================//
// 前方宣言
//====================================================//
class GameObject;

//====================================================//
// マクロ宣言
//====================================================//

// コンポーネントを識別するID

// メインID
#define MAIN_BASE       (0x0000)
#define MAIN_TRANSFORM   (0x0100)
#define MAIN_COLLIDER   (0x0200)
#define MAIN_RIGIDBODY  (0x0300)

// サブ
#define SUB_COLLIDER_SPHERE     (MAIN_COLLIDER | 0x0001)
#define SUB_COLLIDER_CAPSULE    (MAIN_COLLIDER | 0x0002)
#define SUB_COLLIDER_BOX        (MAIN_COLLIDER | 0x0003)
#define SUB_COLLIDER_LINE       (MAIN_COLLIDER | 0x0004)

//====================================================//
// クラス宣言
//====================================================//
class BaseComponent
{
    // ----------------------------------------------------
    // 定数宣言
    // ----------------------------------------------------
public:
    static constexpr int TYPE_ID = MAIN_BASE;
    static constexpr bool IS_MAIN = true;

protected:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // 自身の所有者のポインタ
    GameObject* m_own;

    // アクティブフラグ
    bool m_isActive;

private:
    // 自身のID
    const int m_myID;
    const bool m_isMain;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    BaseComponent(GameObject* own, int id, bool isMain);
    virtual ~BaseComponent();

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------
    GameObject* GetOwn() const { return m_own; }

    bool IsActive() const { return m_isActive; }

    int GetID() const { return m_myID; }
    bool IsMain() const { return m_isMain; }

    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------

    void SetActive(bool f) { m_isActive = f; }

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

};