//====================================================//
// ファイル名  : BaseComponent.cpp
// 概要       : コンポーネントの基底クラス  
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "pch.h"
#include "BaseComponent.h"

#include "../GameObject.h"

//====================================================//
// 関数の実体宣言
//====================================================//

/// <summary>
/// コンストラクタ
/// </summary>
BaseComponent::BaseComponent(GameObject* own)
	: m_own{ own }
	, m_isActive{ TRUE }
{
}

/// <summary>
/// デストラクタ
/// </summary>
BaseComponent::~BaseComponent()
{
}
