//====================================================//
// ファイル名   : RayCast.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/03/20
//
// 概要 : マウスからのレイクラスです
//
// 更新履歴 :
// 2026/03/20 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "GameLib/GameObject/GameObject.h"
#include "Camera.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class RayCast : public GameObject
{
private:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

public:

    // クリックされたオブジェクトポインタ
    GameObject* m_pGameObject;

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    RayCast();
    ~RayCast();

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------
    void Initialize();
    void Update(Camera& camera);

    void DebugDraw();

    void Finalize();

    void OnCollision(BaseCollider* col) override;

    GameObject* GetHitObject() const { return m_pGameObject; };
};