//====================================================//
// ファイル名   : RigidBody.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/06
//
// 概要 : RigidBodyクラス 質量や速度などを管理します
//
// 更新履歴 :
// 2026/04/06 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../BaseComponent.h"

//====================================================//
// 前方宣言
//====================================================//
class GameObject;

//====================================================//
// クラス宣言
//====================================================//
class RigidBody : public BaseComponent
{
    // ----------------------------------------------------
    // 定数宣言
    // ----------------------------------------------------
public:
    static constexpr int TYPE_ID = MAIN_RIGIDBODY;
    static constexpr bool IS_MAIN = true;

private:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------
    
    // 質量
    float m_mass, m_invMass;    // 質量 / 質量の逆数

    // 速度/加速度
    DirectX::SimpleMath::Vector3 m_velocity, m_acceleration;

    // 係数
    float m_friction;       // 摩擦
    float m_restitution;    // 反発

    // フラグ
    bool m_isStatic;    // 固定
    bool m_useGravity;  // 重力の影響

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    RigidBody(GameObject* own);

    ~RigidBody() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------

    float GetMass() const { return m_mass; }
    bool IsStatic() const { return m_isStatic; }

    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------

    void SetMass(float mass) { m_mass = mass; }
    void SetStatic(bool frag) { m_isStatic = frag; }

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

};