//====================================================//
// ファイル名  : SceneTransition.cpp
// 作成者      : Hoshino Ryunosuke
// 作成日       : 2025/12/10
//
// 概要        :  シーン遷移演出の基底クラス
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "SceneTransition.h"

//====================================================//
// 関数の実体宣言
//====================================================//

SceneTransition::SceneTransition(float transSec, Transition::Mode mode)
	: m_transSec{ transSec }
	, m_mode{ mode }
	, m_elapsedTime{ 0 }
{
}
