//====================================================//
// ファイル名   : 2DColliders.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/17
//
// 概要 : 2Dコライダーのincludeをまとめた補助ヘッダ
//
// 更新履歴 :
// 2026/04/17 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../BaseCollider2D.h"
#include "BoxCollider2D.h"
#include "CircleCollider2D.h"
#include "CapsuleCollider2D.h"