//====================================================//
// ファイル名   : 2DComponents.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/16
//
// 概要 : 2Dのコンポーネントをまとめてincludeするための補助ヘッダ
//
// 更新履歴 :
// 2026/04/16 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "Collider/Shapes/2DColliders.h"
#include "Transform/Transform2D.h"
#include "RigidBody/RigidBody2D.h"