//====================================================//
// ファイル名   : BaseComponent2D.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/16
//
// 概要 : 全ての2Dコンポーネントの基底となるクラス
//
// 更新履歴 :
// 2026/04/16 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//

//====================================================//
// 前方宣言
//====================================================//
class GameObject2D;

//====================================================//
// マクロ宣言
//====================================================//

// コンポーネントを識別するID

// メインID
#define MAIN_BASE_2D        (0x0000)
#define MAIN_TRANSFORM_2D   (0x0100)
#define MAIN_COLLIDER_2D    (0x0200)
#define MAIN_RIGIDBODY_2D   (0x0300)
#define MAIN_CAMERA_2D      (0x0400)

// サブ

#define SUB_COLLIDER_2D_CIRCLE      (MAIN_COLLIDER_2D | 0x0001)
#define SUB_COLLIDER_2D_BOX         (MAIN_COLLIDER_2D | 0x0002)
#define SUB_COLLIDER_2D_CAPSULE     (MAIN_COLLIDER_2D | 0x0003)
#define SUB_COLLIDER_2D_TRIANGLE    (MAIN_COLLIDER_2D | 0x0004)

//====================================================//
// クラス宣言
//====================================================//
class BaseComponent2D
{
    // ----------------------------------------------------
    // 定数宣言
    // ----------------------------------------------------
public:
    static constexpr int TYPE_ID = MAIN_BASE_2D;
    static constexpr bool IS_MAIN = true;

protected:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // 自身の所有者のポインタ
    GameObject2D* m_own;

    // アクティブフラグ
    bool m_isActive;

private:
    // 自身のID
    const int m_myID;
    const bool m_isMain;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    BaseComponent2D(GameObject2D* own, int id, bool isMain);
    virtual ~BaseComponent2D();

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------
    GameObject2D* GetOwn() const { return m_own; }

    bool IsActive() const { return m_isActive; }

    int GetID() const { return m_myID; }
    bool IsMain() const { return m_isMain; }

    //-----------------------------------------------------
    // セッター
    //-----------------------------------------------------

    void SetActive(bool f) { m_isActive = f; }

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

};