//====================================================//
// ファイル名   : BaseRenderer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/28
//
// 概要 : レンダラーコンポーネントの基底クラスです
//
// 更新履歴 :
// 2026/04/28 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include "../BaseComponent.h"
#include "../Transform/Transform.h"
#include "GameLib/Common/Renderer/Renderer.h"

//====================================================//
// 前方宣言
//====================================================//


//====================================================//
// クラス宣言
//====================================================//
class BaseRenderer : public BaseComponent
{
    // ----------------------------------------------------
    // 定数宣言
    // ----------------------------------------------------
public:
    static constexpr int TYPE_ID = MAIN_RENDERER;
    static constexpr bool IS_MAIN = true;

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------
    
    // トランスフォームポインタ
    Transform* m_pTransform;


public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    BaseRenderer(GameObject* own, int ID, bool isMain);
    ~BaseRenderer() = default;

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    // 描画関数
    virtual void Draw(Renderer& renderer) = 0;

    //-----------------------------------------------------
    // ゲッター
    //-----------------------------------------------------
protected:
    Transform* GetTransform() const { return m_pTransform; }
};