//====================================================//
// ファイル名   : SpriteRenderer.h
// 作成者       : Hoshino Ryunosuke
// 作成日       : 2026/04/29
//
// 概要 : スプライトの描画を担当するクラス
//
// 更新履歴 :
// 2026/04/29 新規作成
//====================================================//

#pragma once

//====================================================//
// インクルードファイル
//====================================================//
#include <SpriteBatch.h>

#include "../../RenderStateCache.h"
#include "../IRenderer.h"

//====================================================//
// 前方宣言
//====================================================//
class Renderer;

//====================================================//
// クラス宣言
//====================================================//
class SpriteRenderer : public IRenderer
{
private:

    //-----------------------------------------------------
    // メンバ変数
    //-----------------------------------------------------

    // 所有者のRenderer
    Renderer& m_renderer;

    // 描画の状態
    RenderStateCache& m_renderState;

    std::unique_ptr<DirectX::SpriteBatch> m_spriteBatch;

public:

    //-----------------------------------------------------
    // コンストラクタ / デストラクタ
    //-----------------------------------------------------
    SpriteRenderer(Renderer& renderer);
    ~SpriteRenderer();

    //-----------------------------------------------------
    // 公開関数
    //-----------------------------------------------------

    void Initialize() override;
    void Start() override;
    void End() override;

    void DrawGraph
    (
        DirectX::SimpleMath::Vector2 pos,
        ID3D11ShaderResourceView* texture
    );

private:

    //-----------------------------------------------------
    // 内部実装
    //-----------------------------------------------------

};