//====================================================//
// ファイル名  : BoxTemplate.cpp
// 作成者      : Hoshino Ryunosuke
// 作成日       : 2026/04/27
//
// 概要        :  ボックス型のテンプレートオブジェクト
//====================================================//

//====================================================//
// インクルードファイル
//====================================================//
#include "pch.h"
#include "BoxTemplate.h"

//====================================================//
// 関数の実体宣言
//====================================================//

/// <summary>
/// コンストラクタ
/// </summary>
BoxTemplate::BoxTemplate()
	: m_pTransform{ GetComponent<Transform>() }
{
	// コンポーネントの追加
	AddComponent<BoxCollider>();

	// todo MeshRendererの追加
}

/// <summary>
/// デストラクタ
/// </summary>
BoxTemplate::~BoxTemplate()
{
}
